In [1]:
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import sklearn
import pandas as pd

In [23]:
ds = pd.read_csv('/Users/suruchichopra/Desktop/Suransh/Github/Perceptron_2017_December/class_06/titanic.csv')
print ds.columns

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [24]:
ds.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
col_to_drop = ['PassengerId','Name','Ticket','Embarked','Cabin']
df = ds.drop(col_to_drop, axis = 1)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [46]:
df = df.dropna(axis = 0) ## Drop All rows which have atleast one NAN Value
print df.values.shape
df.head()

(714, 7)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250
3         1       1    1  35.0      1      0  53.1000
4         0       3    0  35.0      0      0   8.0500

In [28]:
sex_mapping = {
    'male': 0,
    'female': 1
}
df.Sex = df.Sex.map(sex_mapping)
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250
3         1       1    1  35.0      1      0  53.1000
4         0       3    0  35.0      0      0   8.0500

In [32]:
data = df.values
print type(data)

## Split into Test and Train
split = int(0.80 * data.shape[0])

X_train = data[:split, 1:]
X_test = data[split:,1:]

Y_train = data[ :split, 0 ]
Y_test = data[ split: , 0 ]

print X_train.shape, Y_train.shape
print X_test.shape, Y_test.shape

<type 'numpy.ndarray'>
(571, 6) (571,)
(143, 6) (143,)

In [33]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [43]:
dt = DecisionTreeClassifier()
dt.fit(X_train, Y_train)
print 100*dt.score(X_train, Y_train)
print 100*dt.score(X_test, Y_test)

98.4238178634
78.3216783217

In [45]:
rf = RandomForestClassifier()
rf.fit(X_train,Y_train)
print 100*rf.score(X_train, Y_train)
print 100*rf.score(X_test, Y_test)

96.1471103327
82.5174825175

In [130]:
from sklearn import datasets
iris = datasets.load_iris()
data = iris.data.tolist()
target = iris.target.tolist()
for ix in range(len(data)):
    data[ix].append(target[ix])
data = np.array(data)
np.random.shuffle(data)
print data.shape

(150, 5)

In [131]:
split = int(0.60*data.shape[0])
X_train = data[:split,:-1]
X_test = data[split:,:-1]

In [132]:
Y_train = data[:split, -1]
print Y_train
Y_test = data[split:,-1]

[ 0.  1.  0.  0.  0.  0.  0.  0.  2.  0.  1.  2.  2.  2.  2.  0.  2.  0.
  1.  0.  1.  2.  2.  2.  2.  1.  2.  1.  2.  0.  2.  1.  1.  1.  1.  1.
  1.  0.  2.  0.  1.  2.  2.  0.  2.  0.  2.  1.  0.  2.  2.  1.  1.  1.
  2.  2.  0.  0.  0.  2.  0.  2.  2.  0.  2.  1.  1.  2.  0.  0.  2.  0.
  2.  0.  0.  2.  1.  1.  1.  0.  2.  0.  0.  1.  1.  1.  1.  2.  2.  1.]

In [138]:
## Implementing K Nearest Neighbour
from sklearn.neighbors import KNeighborsClassifier
kn = KNeighborsClassifier()
kn.fit(X_train,Y_train)
print 100*kn.score(X_test, Y_test)

95.0

In [134]:
## Implementing Decision tree
from sklearn.tree import DecisionTreeClassifier
dt = DecisionTreeClassifier()
dt.fit(X_train, Y_train)
print (100*dt.score(X_test,Y_test))

93.3333333333

In [135]:
## Implementing Random Forest
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()
rf.fit(X_train, Y_train)
print 100*rf.score(X_test, Y_test)

91.6666666667